artist_name =    ''
lyricUrl_url =   ''
cd_name =        ''
cd_released_at = ''
song_name =      ''
song_lyricist =  ''
song_composer =  ''
song_arranger =  ''
cds_name = []
note          = nil

artist = Artist.find_by(name: artist_name) || Artist.create(name: artist_name)
cd = Cd.find_by(name: cd_name) || Cd.create(name: cd_name, released_at: cd_released_at)

if lyricUrl_url
  lyricUrl = LyricUrl.create(
    url: lyricUrl_url,
    lyric_website_id: LyricWebsite.find_by(name: 'うたまっぷ').id
  )
end

song = Song.create(
  lyric_url_id: lyricUrl ? lyricUrl.id : nil,
  name: song_name,
  lyricist: song_lyricist,
  composer: song_composer,
  arranger: song_arranger,
  cd_id: cd.id,
  artist_id: artist.id,
  note: note
)
if lyricUrl
  LyricUrlSong.create(
    lyric_url_id: lyricUrl.id,
    song_id: song.id
  )
end
CdSong.create(
  cd_id: cd.id,
  song_id: song.id
)

singer = Singer.find_by(name: 'BY PHAR THE DOPEST')
lyrict_type = LyricType.find_by(name: 'HOOK')
Lyric.create(
  song_id: song.id,
  singer_id: singer.id,
  lyric_type_id: lyrict_type.id,
  part_lyric_order: 1,
  lyric: 'パーティ?Saywhat?Saywhat?Saywhat?パーティ?Saywhat?Saywhat?Saywhat?パーティ?Saywhat?Saywhat?Saywhat?パーティ?Saywhat?Saywhat?Saywhat?',
  ruby: 'ぱーてぃせいわっとせいわっとせいわっとぱーてぃせいわっとせいわっとせいわっとぱーてぃせいわっとせいわっとせいわっとぱーてぃせいわっとせいわっとせいわっと',
  lyric_with_ruby: '\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}',
  lyric_order: 1,
)

singer = Singer.find_by(name: 'BY PHAR THE DOPEST')
lyrict_type = LyricType.find_by(name: 'VERSE')
Lyric.create(
  song_id: song.id,
  singer_id: singer.id,
  lyric_type_id: lyrict_type.id,
  part_lyric_order: 1,
  lyric: 'ナニナニ?ナニナニ?ナニ?ナニ?!ナニナニ?今まさに昨日から今日に日付も代わり酒好きのこのメンバーでなら朝まで盛り上がり宴たけなわエンターテナーが見せるバイタリティー今日この場一回限り気にすんなよ時間なんて終電いま発車した三番線がんばってさわげこのなげー夜はさながらバケーションC・U・EそしてMyMenKREVAROCKTEEのレコードが回転すればイスに腰掛けた退屈なギャルも気づけばフロアに絶えず群がる勘違いのハードコア小僧一つ質問だ「なーここはどこ?」このフロア今うちのアリーナ席いいがかり聞くのもマジでだりーや簡単だぜ簡単だぜ満パンの会場飲めや歌えガンガン酒飲んで朝まで今日はパーティだバカになれ日本各地いろんな国理解者増えりゃリタイヤしないなこんなパーティで生き生きする聞き耳たて聴けB.P.T.D.',
  ruby: 'なになになになになになになになにいままさにきのうからきょうにひづけもかわりさけずきのこのめんばーでならあさまでもりあがりえんたけなわえんたーてなーがみせるばいたりてぃーきょうこのばいっかいかぎりきにすんなよじかんなんてしゅうでんいまはっしゃしたさんばんせんがんばってさわげこのなげーよるはさながらばけーしょんしーゆーいーそしてまいめんくればろっくてぃーのれこーどがかいてんすればいすにこしかけたたいくつなぎゃるもきづけばふろあにたえずむらがるかんちがいのはーどこあこぞうひとつしつもんだなーここはどここのふろあいまうちのありーなせきいいがかりきくのもまじでだりーやかんたんだぜかんたんだぜまんぱんのかいじょうのめやうたえがんがんさけのんであさまできょうはぱーてぃだばかになれにほんかくちいろんなくにりかいしゃふえりゃりたいやしないなこんなぱーてぃでいきいきするききみみたてきけびーぴーてぃーでぃー',
  lyric_with_ruby: '\{ナニナニ,なになに\}\{?,\}\{ ,\}\{ナニナニ,なになに\}\{?,\}\{ ,\}\{ナニ,なに\}\{?,\}\{ ,\}\{ナニ,なに\}\{?!,\}\{ ,\}\{ナニナニ,なになに\}\{?,\}\{ ,\}\{今,いま\}まさに\{昨日,きのう\}から\{今日,きょう\}に\{日付,ひづけ\}も\{代わり,かわり\}\{ ,\}\{酒好き,さけずき\}のこの\{メンバー,めんばー\}でなら\{ ,\}\{朝,あさ\}まで\{盛り上がり,もりあがり\}\{宴,えん\}たけなわ\{ ,\}\{エンター,えんたー\}\{テナー,てなー\}が\{見せる,みせる\}\{バイタリティー,ばいたりてぃー\}\{ ,\}\{今日,きょう\}この\{場,ば\}\{一,いっ\}\{回,かい\}\{限り,かぎり\}\{ ,\}\{気,き\}にすんなよ\{時間,じかん\}なんて\{ ,\}\{終電,しゅうでん\}いま\{発車,はっしゃ\}した\{三,さん\}\{番線,ばんせん\}\{ ,\}がんばってさわげ\{ ,\}このなげー\{夜,よる\}はさながら\{バケーション,ばけーしょん\}\{ ,\}\{C,しー\}\{・,\}\{U,ゆー\}\{・,\}\{E,いー\}そして\{My,まい\}\{ ,\}\{Men,めん\}\{ ,\}\{KREVA,くれば\}\{ ,\}\{ROCK,ろっく\}\{ ,\}\{TEE,てぃー\}の\{レコード,れこーど\}が\{回転,かいてん\}すれば\{ ,\}\{イス,いす\}に\{腰掛け,こしかけ\}た\{退屈,たいくつ\}な\{ギャル,ぎゃる\}\{ ,\}も\{気づけ,きづけ\}ば\{フロア,ふろあ\}に\{絶えず,たえず\}\{群がる,むらがる\}\{ ,\}\{勘違い,かんちがい\}の\{ハード,はーど\}\{コア,こあ\}\{小僧,こぞう\}\{ ,\}\{一つ,ひとつ\}\{質問,しつもん\}だ\{「,\}なーここはどこ\{?」,\}\{ ,\}この\{フロア,ふろあ\}\{今,いま\}うちの\{アリーナ,ありーな\}\{席,せき\}\{ ,\}いいがかり\{聞く,きく\}のも\{マジ,まじ\}でだりーや\{ ,\}\{簡単,かんたん\}だぜ\{ ,\}\{簡単,かんたん\}だぜ\{ ,\}\{満,まん\}\{パン,ぱん\}の\{会場,かいじょう\}\{飲め,のめ\}や\{歌え,うたえ\}\{ ,\}\{ガンガン,がんがん\}\{酒,さけ\}\{飲ん,のん\}で\{朝,あさ\}まで\{ ,\}\{今日,きょう\}は\{パーティ,ぱーてぃ\}だ\{バカ,ばか\}になれ\{ ,\}\{日本,にほん\}\{各地,かくち\}いろんな\{国,くに\}\{ ,\}\{理解,りかい\}\{者,しゃ\}\{増えりゃ,ふえりゃ\}\{リタイヤ,りたいや\}しないな\{ ,\}こんな\{パーティ,ぱーてぃ\}で\{生き生き,いきいき\}する\{ ,\}\{聞き耳,ききみみ\}たて\{聴け,きけ\}\{ ,\}\{B,びー\}\{.,\}\{P,ぴー\}\{.,\}\{T,てぃー\}\{.,\}\{D,でぃー\}\{.,\}\{ ,\}',
  lyric_order: 2,
)

singer = Singer.find_by(name: 'BY PHAR THE DOPEST')
lyrict_type = LyricType.find_by(name: 'HOOK')
Lyric.create(
  song_id: song.id,
  singer_id: singer.id,
  lyric_type_id: lyrict_type.id,
  part_lyric_order: 2,
  lyric: 'パーティ?Saywhat?Saywhat?Saywhat?パーティ?Saywhat?Saywhat?Saywhat?パーティ?Saywhat?Saywhat?Saywhat?パーティ?Saywhat?Saywhat?Saywhat?',
  ruby: 'ぱーてぃせいわっとせいわっとせいわっとぱーてぃせいわっとせいわっとせいわっとぱーてぃせいわっとせいわっとせいわっとぱーてぃせいわっとせいわっとせいわっと',
  lyric_with_ruby: '\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{パーティ,ぱーてぃ\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}\{Say,せい\}\{ ,\}\{what,わっと\}\{?,\}\{ ,\}',
  lyric_order: 3,
)

singer = Singer.find_by(name: 'BY PHAR THE DOPEST')
lyrict_type = LyricType.find_by(name: 'VERSE')
Lyric.create(
  song_id: song.id,
  singer_id: singer.id,
  lyric_type_id: lyrict_type.id,
  part_lyric_order: 2,
  lyric: '予想以上のショー保証付き上手に乗りこなせよこのドープビーツよーく見ると遠くにいる男達見せるパーティの志女つまりギャル達もほろ酔いぎみ頬が桜色アル・パチーノ並みの渋さじゃなくてジム・キャリーみたいにかますぜほらほら刻々と時は経ついつの間にもう今日の0時過ぎこのままオールナイト酒のつまみはビート文句無いさあ踊りなオレらこそ今最高のコンビだ汗で汚した服も時にはオレの誇りだこの声が今轟いた',
  ruby: 'よそういじょうのしょーほしょうつきじょうずにのりこなせよこのどーぷびーつよーくみるととおくにいるおとこたちみせるぱーてぃのこころざしおんなつまりぎゃるたちもほろよいぎみほほがさくらいろあるぱちーのなみのしぶさじゃなくてじむきゃりーみたいにかますぜほらほらこくこくとときはたついつのまにもうきょうのれいじすぎこのままおーるないとさけのつまみはびーともんくないさあおどりなおれらこそいまさいこうのこんびだあせでよごしたふくもときにはおれのほこりだこのこえがいまとどろいた',
  lyric_with_ruby: '\{予想,よそう\}\{以上,いじょう\}の\{ショー,しょー\}\{保証,ほしょう\}\{付き,つき\}\{ ,\}\{上手,じょうず\}に\{乗りこなせよ,のりこなせよ\}この\{ドープビーツ,どーぷびーつ\}\{ ,\}よーく\{見る,みる\}と\{遠く,とおく\}にいる\{男,おとこ\}\{達,たち\}\{ ,\}\{見せる,みせる\}\{パーティ,ぱーてぃ\}の\{志,こころざし\}\{ ,\}\{女,おんな\}つまり\{ギャル,ぎゃる\}\{達,たち\}も\{ ,\}\{ほろ酔い,ほろよい\}ぎみ\{頬,ほほ\}が\{桜,さくら\}\{色,いろ\}\{ ,\}\{アル・パチーノ,あるぱちーの\}\{並み,なみ\}の\{渋,しぶ\}さじゃなくて\{ ,\}\{ジム,じむ\}\{・,\}\{キャリー,きゃりー\}みたいにかますぜ\{ ,\}ほらほら\{刻々,こくこく\}と\{時,とき\}は\{経つ,たつ\}\{ ,\}\{いつの間に,いつのまに\}もう\{今日,きょう\}の\{ ,\}\{0,れい\}\{時,じ\}\{過ぎ,すぎ\}このまま\{オールナイト,おーるないと\}\{ ,\}\{酒,さけ\}のつまみは\{ビート,びーと\}\{文句,もんく\}\{無い,ない\}\{ ,\}さあ\{踊り,おどり\}な\{オレ,おれ\}らこそ\{今,いま\}\{最高,さいこう\}の\{コンビ,こんび\}だ\{ ,\}\{汗,あせ\}で\{汚し,よごし\}た\{服,ふく\}も\{時には,ときには\}\{オレ,おれ\}の\{誇り,ほこり\}だ\{ ,\}この\{声,こえ\}が\{今,いま\}\{轟い,とどろい\}た\{ ,\}',
  lyric_order: 4,
)

